zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXC/MCXC162/drivers/fsl_clock.h
/*
 * Copyright 2025-2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_CLOCK_H_
#define _FSL_CLOCK_H_

#include "fsl_common.h"

/*! @addtogroup clock */
/*! @{ */

/*! @file */

/*******************************************************************************
 * Definitions
 *****************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief CLOCK driver version 2.0.1. */
#define FSL_CLOCK_DRIVER_VERSION (MAKE_VERSION(2, 0, 1))
/*@}*/

/*! @brief Configure whether driver controls clock
 *
 * When set to 0, peripheral drivers will enable clock in initialize function
 * and disable clock in de-initialize function. When set to 1, peripheral
 * driver will not control the clock, application could control the clock out of
 * the driver.
 *
 * @note All drivers share this feature switcher. If it is set to 1, application
 * should handle clock enable and disable for all drivers.
 */
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL))
#define FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL 0U
#endif

/*!
 * @brief User-defined the size of cache for CLOCK_PllGetConfig() function.
 *
 * Once define this MACRO to be non-zero value, CLOCK_PllGetConfig() function
 * would cache the recent calulation and accelerate the execution to get the
 * right settings.
 */
#ifndef CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT
#define CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT 2U
#endif

/* Definition for delay API in clock driver, users can redefine it to the real application. */
#ifndef SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY
#define SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY (96000000U)
#endif

/*! @brief Clock gate name used for CLOCK_EnableClock/CLOCK_DisableClock. */
/*------------------------------------------------------------------------------
 clock_ip_name_t definition:
------------------------------------------------------------------------------*/
#define CLK_GATE_REG_OFFSET(value) (((uint32_t)(value)) >> 16U)
#define CLK_GATE_BIT_SHIFT(value)  (((uint32_t)(value)) & 0x0000FFFFU)

#define REG_PWM0SUBCTL (250U)

/*! @brief Clock gate name used for CLOCK_EnableClock/CLOCK_DisableClock. */
typedef enum _clock_ip_name
{
    kCLOCK_InputMux      = ((0x00U << 16U) | (0U)),         /*!< Clock gate name: INPUTMUX0 */
    kCLOCK_GateINPUTMUX0 = ((0x00U << 16U) | (0U)),         /*!< Clock gate name: INPUTMUX0 */
    kCLOCK_GateFREQME    = ((0x00U << 16U) | (1U)),         /*!< Clock gate name: FREQME    */
    kCLOCK_GateCTIMER0   = ((0x00U << 16U) | (2U)),         /*!< Clock gate name: CTIMER0   */
    kCLOCK_GateCTIMER1   = ((0x00U << 16U) | (3U)),         /*!< Clock gate name: CTIMER1   */
    kCLOCK_GateWWDT0     = ((0x00U << 16U) | (8U)),         /*!< Clock gate name: WWDT0     */
    kCLOCK_GateWWDT1     = ((0x00U << 16U) | (9U)),         /*!< Clock gate name: WWDT1     */
    kCLOCK_GateDMA0      = ((0x00U << 16U) | (10U)),        /*!< Clock gate name: DMA0      */
    kCLOCK_GateCRC0      = ((0x00U << 16U) | (12U)),        /*!< Clock gate name: CRC0      */
    kCLOCK_Crc0          = ((0x00U << 16U) | (12U)),        /*!< Clock gate name: CRC0      */
    kCLOCK_GateEIM0      = ((0x00U << 16U) | (13U)),        /*!< Clock gate name: EIM0      */
    kCLOCK_GateERM0      = ((0x00U << 16U) | (14U)),        /*!< Clock gate name: ERM0      */
    kCLOCK_GateFLEXPWM0  = ((0x00U << 16U) | (30U)),        /*!< Clock gate name: FLEXPWM0  */

    kCLOCK_GateLPI2C0  = ((0x10U << 16U) | (0U)),           /*!< Clock gate name: LPI2C0    */
    kCLOCK_GateLPSPI0  = ((0x10U << 16U) | (4U)),           /*!< Clock gate name: LPSPI0    */
    kCLOCK_GateLPUART0 = ((0x10U << 16U) | (8U)),           /*!< Clock gate name: LPUART0   */
    kCLOCK_GateLPUART1 = ((0x10U << 16U) | (9U)),           /*!< Clock gate name: LPUART1   */
    kCLOCK_GateLPUART2 = ((0x10U << 16U) | (10U)),          /*!< Clock gate name: LPUART2   */
    kCLOCK_GateLPUART3 = ((0x10U << 16U) | (11U)),          /*!< Clock gate name: LPUART3   */
    kCLOCK_GateADC0    = ((0x10U << 16U) | (16U)),          /*!< Clock gate name: ADC0      */
    kCLOCK_GateCMP0    = ((0x10U << 16U) | (20U)),          /*!< Clock gate name: CMP0      */
    kCLOCK_GateOPAMP0  = ((0x10U << 16U) | (25U)),          /*!< Clock gate name: OPAMP0    */

    kCLOCK_GatePORT0  = ((0x20U << 16U) | (0U)),            /*!< Clock gate name: PORT0     */
    kCLOCK_GatePORT1  = ((0x20U << 16U) | (1U)),            /*!< Clock gate name: PORT1     */
    kCLOCK_GatePORT2  = ((0x20U << 16U) | (2U)),            /*!< Clock gate name: PORT2     */
    kCLOCK_GatePORT3  = ((0x20U << 16U) | (3U)),            /*!< Clock gate name: PORT3     */
    kCLOCK_GateGPIO0  = ((0x20U << 16U) | (6U)),            /*!< Clock gate name: GPIO0     */
    kCLOCK_GateGPIO1  = ((0x20U << 16U) | (7U)),            /*!< Clock gate name: GPIO1     */
    kCLOCK_GateGPIO2  = ((0x20U << 16U) | (8U)),            /*!< Clock gate name: GPIO2     */
    kCLOCK_GateGPIO3  = ((0x20U << 16U) | (9U)),            /*!< Clock gate name: GPIO3     */
    kCLOCK_GateRAMA   = ((0x20U << 16U) | (12U)),           /*!< Clock gate name: RAMA      */
    kCLOCK_GateTRNG0  = ((0x20U << 16U) | (25U)),           /*!< Clock gate name: TRNG0     */
    kCLOCK_GateSECCON = ((0x20U << 16U) | (26U)),           /*!< Clock gate name: SECCON    */

    kCLOCK_GatePWM0SM0  = ((REG_PWM0SUBCTL << 16U) | (0U)), /*!< Clock gate name: PWM0 SM0  */
    kCLOCK_GatePWM0SM1  = ((REG_PWM0SUBCTL << 16U) | (1U)), /*!< Clock gate name: PWM0 SM1  */
    kCLOCK_GatePWM0SM2  = ((REG_PWM0SUBCTL << 16U) | (2U)), /*!< Clock gate name: PWM0 SM2  */
    kCLOCK_GateNotAvail = (0xFFFFFFFFU),                    /*!< Clock gate name: None      */
} clock_ip_name_t;

/*! @brief Clock ip name array for CRC. */
#define CRC_CLOCKS {kCLOCK_GateCRC0}
/*! @brief Clock ip name array for CTIMER. */
#define CTIMER_CLOCKS {kCLOCK_GateCTIMER0, kCLOCK_GateCTIMER1}
/*! @brief Clock ip name array for DMA. */
#define DMA_CLOCKS {kCLOCK_GateDMA0}
/*! @brief Clock gate name array for EDMA. */
#define EDMA_CLOCKS {kCLOCK_GateDMA0}
/*! @brief Clock ip name array for ERM. */
#define ERM_CLOCKS {kCLOCK_GateERM0}
/*! @brief Clock ip name array for EIM. */
#define EIM_CLOCKS {kCLOCK_GateEIM0}
/*! @brief Clock ip name array for FREQME. */
#define FREQME_CLOCKS {kCLOCK_GateFREQME}
/*! @brief Clock ip name array for GPIO. */
#define GPIO_CLOCKS {kCLOCK_GateGPIO0, kCLOCK_GateGPIO1, kCLOCK_GateGPIO2, kCLOCK_GateGPIO3}
/*! @brief Clock ip name array for INPUTMUX. */
#define INPUTMUX_CLOCKS {kCLOCK_GateINPUTMUX0}
/*! @brief Clock ip name array for LPCMP. */
#define LPCMP_CLOCKS {kCLOCK_GateCMP0}
/*! @brief Clock ip name array for LPADC. */
#define LPADC_CLOCKS {kCLOCK_GateADC0}
/*! @brief Clock ip name array for LPUART. */
#define LPUART_CLOCKS {kCLOCK_GateLPUART0, kCLOCK_GateLPUART1, kCLOCK_GateLPUART2, kCLOCK_GateLPUART3}
/*! @brief Clock ip name array for LPI2C. */
#define LPI2C_CLOCKS {kCLOCK_GateLPI2C0}
/*! @brief Clock ip name array for LPSPI. */
#define LPSPI_CLOCKS {kCLOCK_GateLPSPI0}
/*! @brief Clock ip name array for OPAMP. */
#define OPAMP_CLOCKS {kCLOCK_GateOPAMP0}
/*! @brief Clock ip name array for PORT. */
#define PORT_CLOCKS {kCLOCK_GatePORT0, kCLOCK_GatePORT1, kCLOCK_GatePORT2, kCLOCK_GatePORT3}
/*! @brief Clock ip name array for TRNG. */
#define TRNG_CLOCKS {kCLOCK_GateTRNG0}
/*! @brief Clock ip name array for WWDT. */
#define WWDT_CLOCKS {kCLOCK_GateWWDT0, kCLOCK_GateWWDT1}
/*! @brief Clock ip name array for FLEXPWM. */
#define FLEXPWM_CLOCKS {kCLOCK_GateFLEXPWM0}
/*! @brief Clock ip name array for RAMA. */
#define RAMA_CLOCKS {kCLOCK_GateRAMA}
/*! @brief Clock ip name array for SECCON. */
#define SECCON_CLOCKS {kCLOCK_GateSECCON}
/*! @brief Clock ip name array for ATX. */
#define ATX_CLOCKS {kCLOCK_GateATX0}
/*! @brief Clock ip name array for TCU. */
#define TCU_CLOCKS {kCLOCK_GateTCU}
/*! @brief Clock ip name array for PWM. */
#define PWM_CLOCKS                                                    \
    {                                                                 \
        {kCLOCK_GatePWM0SM0, kCLOCK_GatePWM0SM1, kCLOCK_GatePWM0SM2}, \
    }

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_name
{
    kCLOCK_MainClk,    /*!< MAIN_CLK                   */
    kCLOCK_CoreSysClk, /*!< Core/system clock(CPU_CLK) */
    kCLOCK_SYSTEM_CLK, /*!< SYSTEM clock/AHB_BUS       */
    kCLOCK_BusClk,     /*!< SYSTEM clock               */
    kCLOCK_ExtClk,     /*!< External Clock             */
    kCLOCK_FroHf,      /*!< FRO192                     */
    kCLOCK_FroHfDiv,   /*!< Divided by FRO192          */
    kCLOCK_Fro12M,     /*!< FRO12M                     */
    kCLOCK_Fro12MDiv,  /*!< FRO12MDiv                  */
    kCLOCK_Clk1M,      /*!< CLK1M                      */
    kCLOCK_Fro16K,     /*!< FRO16K                     */
    kCLOCK_Clk16K0,    /*!< CLK16K[0]                  */
    kCLOCK_Clk16K1,    /*!< CLK16K[1]                  */
    kCLOCK_Osc32K0,    /*!< OSC32K[0]                  */
    kCLOCK_Osc32K1,    /*!< OSC32K[1]                  */
    kCLOCK_SLOW_CLK,   /*!< SYSTEM_CLK divided by 4    */
} clock_name_t;

/*! @brief Peripherals clock source definition. */
#define BUS_CLK kCLOCK_BusClk

/*! @brief Clock Mux Switches
 *  The encoding is as follows each connection identified is 32bits wide while 24bits are valuable
 *  starting from LSB upwards
 *
 *  [4 bits for choice, 0 means invalid choice] [8 bits mux ID]*
 *
 */

#define CLK_ATTACH_REG_OFFSET(value) (((uint32_t)(value)) >> 16U)
#define CLK_ATTACH_CLK_SEL(value)    (((uint32_t)(value)) & 0x0000FFFFU)
#define CLK_ATTACH_MUX(reg, sel)     ((((uint32_t)(reg)) << 16U) | (sel))

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_select_name
{
    kCLOCK_SelCTIMER0 = (0x100U), /*!< CTIMER0 clock selection */
    kCLOCK_SelCTIMER1 = (0x108U), /*!< CTIMER1 clock selection */
    kCLOCK_SelWWDT1   = (0x118U), /*!< WWDT1   clock selection */
    kCLOCK_SelLPI2C0  = (0x120U), /*!< LPI2C0  clock selection */
    kCLOCK_SelLPSPI0  = (0x128U), /*!< LPSPI0  clock selection */
    kCLOCK_SelLPUART0 = (0x130U), /*!< LPUART0 clock selection */
    kCLOCK_SelLPUART1 = (0x138U), /*!< LPUART1 clock selection */
    kCLOCK_SelLPUART2 = (0x140U), /*!< LPUART2 clock selection */
    kCLOCK_SelLPUART3 = (0x148U), /*!< LPUART3 clock selection */
    kCLOCK_SelLPTMR0  = (0x150U), /*!< LPTMR0  clock selection */
    kCLOCK_SelADC     = (0x158U), /*!< ADC     clock selection */
    kCLOCK_SelCMP0    = (0x168U), /*!< CMP0    clock selection */
    kCLOCK_SelTRACE   = (0x170U), /*!< TRACE   clock selection */
    kCLOCK_SelCLKOUT  = (0x178U), /*!< CLKOUT  clock selection */
    kCLOCK_SelSYSTICK = (0x180U), /*!< SYSTICK clock selection */
    kCLOCK_SelSCGSCS  = (0x200U), /*!< SCG SCS clock selection */
    kCLOCK_SelMax     = (0x200U), /*!< MAX     clock selection */
} clock_select_name_t;

/*!
 * @brief The enumerator of clock attach Id.
 */
typedef enum _clock_attach_id
{
    kCLK_IN_to_MAIN_CLK  = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 1U),    /*!< Attach clk_in to MAIN_CLK.     */
    kFRO12M_to_MAIN_CLK  = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 2U),    /*!< Attach FRO_12M to MAIN_CLK.    */
    kFRO_HF_to_MAIN_CLK  = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 3U),    /*!< Attach FRO_HF to MAIN_CLK.     */
    kCLK_32K_to_MAIN_CLK = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 4U),    /*!< Attach CLK_32K[1] to MAIN_CLK. */
    kNONE_to_MAIN_CLK    = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 7U),    /*!< Attach NONE to MAIN_CLK.       */

    kFRO_LF_DIV_to_CTIMER0 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 0U), /*!< Attach FRO_LF_DIV to CTIMER0. */
    kFRO_HF_to_CTIMER0     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 1U), /*!< Attach FRO_HF to CTIMER0.     */
    kCLK_IN_to_CTIMER0     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 3U), /*!< Attach CLK_IN to CTIMER0.     */
    kCLK_16K_to_CTIMER0    = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 4U), /*!< Attach CLK_16K to CTIMER0.    */
    kCLK_1M_to_CTIMER0     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 5U), /*!< Attach CLK_1M to CTIMER0.     */
    kNONE_to_CTIMER0       = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 7U), /*!< Attach NONE to CTIMER0.       */

    kFRO_LF_DIV_to_CTIMER1 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 0U), /*!< Attach FRO_LF_DIV to CTIMER1. */
    kFRO_HF_to_CTIMER1     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 1U), /*!< Attach FRO_HF to CTIMER1.     */
    kCLK_IN_to_CTIMER1     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 3U), /*!< Attach CLK_IN to CTIMER1.     */
    kCLK_16K_to_CTIMER1    = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 4U), /*!< Attach CLK_16K to CTIMER1.    */
    kCLK_1M_to_CTIMER1     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 5U), /*!< Attach CLK_1M to CTIMER1.     */
    kNONE_to_CTIMER1       = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 7U), /*!< Attach NONE to CTIMER1.       */

    kFRO_LF_DIV_to_LPI2C0 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 0U),   /*!< Attach FRO_LF_DIV to LPI2C0. */
    kFRO_HF_DIV_to_LPI2C0 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 2U),   /*!< Attach FRO_HF_DIV to LPI2C0. */
    kCLK_IN_to_LPI2C0     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 3U),   /*!< Attach CLK_IN to LPI2C0.     */
    kCLK_1M_to_LPI2C0     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 5U),   /*!< Attach CLK_1M to LPI2C0.     */
    kNONE_to_LPI2C0       = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 7U),   /*!< Attach NONE to LPI2C0.       */

    kFRO_LF_DIV_to_LPSPI0 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI0, 0U),   /*!< Attach FRO_LF_DIV to LPSPI0. */
    kFRO_HF_DIV_to_LPSPI0 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI0, 2U),   /*!< Attach FRO_HF_DIV to LPSPI0. */
    kCLK_IN_to_LPSPI0     = CLK_ATTACH_MUX(kCLOCK_SelLPSPI0, 3U),   /*!< Attach CLK_IN to LPSPI0.     */
    kCLK_1M_to_LPSPI0     = CLK_ATTACH_MUX(kCLOCK_SelLPSPI0, 5U),   /*!< Attach CLK_1M to LPSPI0.     */
    kNONE_to_LPSPI0       = CLK_ATTACH_MUX(kCLOCK_SelLPSPI0, 7U),   /*!< Attach NONE to LPSPI0.       */

    kFRO_LF_DIV_to_LPUART0 = CLK_ATTACH_MUX(kCLOCK_SelLPUART0, 0U), /*!< Attach FRO_LF_DIV to LPUART0. */
    kFRO_HF_DIV_to_LPUART0 = CLK_ATTACH_MUX(kCLOCK_SelLPUART0, 2U), /*!< Attach FRO_HF_DIV to LPUART0. */
    kCLK_IN_to_LPUART0     = CLK_ATTACH_MUX(kCLOCK_SelLPUART0, 3U), /*!< Attach CLK_IN to LPUART0.     */
    kCLK_32K_to_LPUART0    = CLK_ATTACH_MUX(kCLOCK_SelLPUART0, 4U), /*!< Attach CLK_16K to LPUART0.    */
    kCLK_1M_to_LPUART0     = CLK_ATTACH_MUX(kCLOCK_SelLPUART0, 5U), /*!< Attach CLK_1M to LPUART0.     */
    kNONE_to_LPUART0       = CLK_ATTACH_MUX(kCLOCK_SelLPUART0, 7U), /*!< Attach NONE to LPUART0.       */

    kFRO_LF_DIV_to_LPUART1 = CLK_ATTACH_MUX(kCLOCK_SelLPUART1, 0U), /*!< Attach FRO_LF_DIV to LPUART1. */
    kFRO_HF_DIV_to_LPUART1 = CLK_ATTACH_MUX(kCLOCK_SelLPUART1, 2U), /*!< Attach FRO_HF_DIV to LPUART1. */
    kCLK_IN_to_LPUART1     = CLK_ATTACH_MUX(kCLOCK_SelLPUART1, 3U), /*!< Attach CLK_IN to LPUART1.     */
    kCLK_32K_to_LPUART1    = CLK_ATTACH_MUX(kCLOCK_SelLPUART1, 4U), /*!< Attach CLK_16K to LPUART1.    */
    kCLK_1M_to_LPUART1     = CLK_ATTACH_MUX(kCLOCK_SelLPUART1, 5U), /*!< Attach CLK_1M to LPUART1.     */
    kNONE_to_LPUART1       = CLK_ATTACH_MUX(kCLOCK_SelLPUART1, 7U), /*!< Attach NONE to LPUART1.       */

    kFRO_LF_DIV_to_LPUART2 = CLK_ATTACH_MUX(kCLOCK_SelLPUART2, 0U), /*!< Attach FRO_LF_DIV to LPUART2. */
    kFRO_HF_DIV_to_LPUART2 = CLK_ATTACH_MUX(kCLOCK_SelLPUART2, 2U), /*!< Attach FRO_HF_DIV to LPUART2. */
    kCLK_IN_to_LPUART2     = CLK_ATTACH_MUX(kCLOCK_SelLPUART2, 3U), /*!< Attach CLK_IN to LPUART2.     */
    kCLK_32K_to_LPUART2    = CLK_ATTACH_MUX(kCLOCK_SelLPUART2, 4U), /*!< Attach CLK_16K to LPUART2.    */
    kCLK_1M_to_LPUART2     = CLK_ATTACH_MUX(kCLOCK_SelLPUART2, 5U), /*!< Attach CLK_1M to LPUART2.     */
    kNONE_to_LPUART2       = CLK_ATTACH_MUX(kCLOCK_SelLPUART2, 7U), /*!< Attach NONE to LPUART2.       */

