zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXC/MCXC162/drivers/fsl_clock.h
    kFRO_LF_DIV_to_LPUART3 = CLK_ATTACH_MUX(kCLOCK_SelLPUART3, 0U), /*!< Attach FRO_LF_DIV to LPUART2. */
    kFRO_HF_DIV_to_LPUART3 = CLK_ATTACH_MUX(kCLOCK_SelLPUART3, 2U), /*!< Attach FRO_HF_DIV to LPUART2. */
    kCLK_IN_to_LPUART3     = CLK_ATTACH_MUX(kCLOCK_SelLPUART3, 3U), /*!< Attach CLK_IN to LPUART2.     */
    kCLK_32K_to_LPUART3    = CLK_ATTACH_MUX(kCLOCK_SelLPUART3, 4U), /*!< Attach CLK_16K to LPUART2.    */
    kCLK_1M_to_LPUART3     = CLK_ATTACH_MUX(kCLOCK_SelLPUART3, 5U), /*!< Attach CLK_1M to LPUART2.     */
    kNONE_to_LPUART3       = CLK_ATTACH_MUX(kCLOCK_SelLPUART3, 7U), /*!< Attach NONE to LPUART2.       */

    kFRO_LF_DIV_to_LPTMR0 = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 0U),   /*!< Attach FRO_LF_DIV to LPTMR0. */
    kFRO_HF_DIV_to_LPTMR0 = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 2U),   /*!< Attach FRO_HF_DIV to LPTMR0. */
    kCLK_IN_to_LPTMR0     = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 3U),   /*!< Attach CLK_IN to LPTMR0.     */
    kCLK_1M_to_LPTMR0     = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 5U),   /*!< Attach CLK_1M to LPTMR0.     */
    kNONE_to_LPTMR0       = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 7U),   /*!< Attach NONE to LPTMR0.       */

    kFRO_LF_DIV_to_ADC = CLK_ATTACH_MUX(kCLOCK_SelADC, 0U),         /*!< Attach FRO_LF_DIV to ADC. */
    kFRO_HF_to_ADC     = CLK_ATTACH_MUX(kCLOCK_SelADC, 1U),         /*!< Attach FRO_HF to ADC.     */
    kCLK_IN_to_ADC     = CLK_ATTACH_MUX(kCLOCK_SelADC, 3U),         /*!< Attach CLK_IN to ADC.     */
    kCLK_1M_to_ADC     = CLK_ATTACH_MUX(kCLOCK_SelADC, 5U),         /*!< Attach CLK_1M to ADC.     */
    kNONE_to_ADC       = CLK_ATTACH_MUX(kCLOCK_SelADC, 7U),         /*!< Attach NONE to ADC.       */

    kFRO_LF_DIV_to_CMP0 = CLK_ATTACH_MUX(kCLOCK_SelCMP0, 0U),       /*!< Attach FRO_LF_DIV to CMP0. */
    kFRO_HF_DIV_to_CMP0 = CLK_ATTACH_MUX(kCLOCK_SelCMP0, 2U),       /*!< Attach FRO_HF_DIV to CMP0. */
    kCLK_IN_to_CMP0     = CLK_ATTACH_MUX(kCLOCK_SelCMP0, 3U),       /*!< Attach CLK_IN to CMP0.     */
    kCLK_1M_to_CMP0     = CLK_ATTACH_MUX(kCLOCK_SelCMP0, 5U),       /*!< Attach CLK_1M to CMP0.     */
    kNONE_to_CMP0       = CLK_ATTACH_MUX(kCLOCK_SelCMP0, 7U),       /*!< Attach NONE to CMP0.       */

    kCPU_CLK_to_TRACE = CLK_ATTACH_MUX(kCLOCK_SelTRACE, 0U),        /*!< Attach CPU_CLK to TRACE. */
    kCLK_1M_to_TRACE  = CLK_ATTACH_MUX(kCLOCK_SelTRACE, 1U),        /*!< Attach CLK_1M to TRACE.  */
    kCLK_16K_to_TRACE = CLK_ATTACH_MUX(kCLOCK_SelTRACE, 2U),        /*!< Attach CLK_16K to TRACE. */
    kNONE_to_TRACE    = CLK_ATTACH_MUX(kCLOCK_SelTRACE, 3U),        /*!< Attach NONE to TRACE.    */

    kFRO12M_to_CLKOUT     = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 0U),   /*!< Attach FRO_12M to CLKOUT.    */
    kFRO_HF_DIV_to_CLKOUT = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 1U),   /*!< Attach FRO_HF_DIV to CLKOUT. */
    kCLK_IN_to_CLKOUT     = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 2U),   /*!< Attach CLK_IN to CLKOUT.     */
    kCLK_16K_to_CLKOUT    = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 3U),   /*!< Attach CLK_16K to CLKOUT.    */
    kSLOW_CLK_to_CLKOUT   = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 6U),   /*!< Attach SLOW_CLK to CLKOUT.   */
    kNONE_to_CLKOUT       = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 7U),   /*!< Attach NONE to CLKOUT.       */

    kCPU_CLK_to_SYSTICK = CLK_ATTACH_MUX(kCLOCK_SelSYSTICK, 0U),    /*!< Attach CPU_CLK to SYSTICK. */
    kCLK_1M_to_SYSTICK  = CLK_ATTACH_MUX(kCLOCK_SelSYSTICK, 1U),    /*!< Attach CLK_1M to SYSTICK.  */
    kCLK_16K_to_SYSTICK = CLK_ATTACH_MUX(kCLOCK_SelSYSTICK, 2U),    /*!< Attach CLK_16K to SYSTICK. */
    kNONE_to_SYSTICK    = CLK_ATTACH_MUX(kCLOCK_SelSYSTICK, 3U),    /*!< Attach NONE to SYSTICK.    */

    kCLK_16K_to_WWDT1    = CLK_ATTACH_MUX(kCLOCK_SelWWDT1, 0U),     /*!< Attach CLK_16K to WWDT1. */
    kFRO_HF_DIV_to_WWDT1 = CLK_ATTACH_MUX(kCLOCK_SelWWDT1, 1U),     /*!< Attach FRO_HF_DIV to WWDT1.  */
    kCLK_1M_to_WWDT1     = CLK_ATTACH_MUX(kCLOCK_SelWWDT1, 2U),     /*!< Attach CLK_1M to WWDT1. */
    kNONE_to_WWDT1       = CLK_ATTACH_MUX(kCLOCK_SelWWDT1, 3U),     /*!< Attach NONE to WWDT1.    */

    kNONE_to_NONE = (0xFFFFFFFFU),                                  /*!< Attach NONE to NONE. */

} clock_attach_id_t;

/*! @brief Clock dividers */
typedef enum _clock_div_name
{
    /* CLKDIV in SYSCON */
    kCLOCK_DivAHBCLK  = (0x80U), /*!< AHBCLK    clock divider */
    kCLOCK_DivSLOWCLK = (0x88U), /*!< SLOWCLK   clock divider */
    kCLOCK_DivFRO_HF  = (0x90U), /*!< FROHF     clock divider */
    kCLOCK_DivFRO_LF  = (0x94U), /*!< FROLF     clock divider */
    /* CLKDIV in MRCC */
    kCLOCK_DivCTIMER0   = (0x104U + 0x800U), /*!< CTIMER0   clock divider */
    kCLOCK_DivCTIMER1   = (0x10CU + 0x800U), /*!< CTIMER1   clock divider */
    kCLOCK_DivWWDT0     = (0x114U + 0x800U), /*!< WWDT0     clock divider */
    kCLOCK_DivWWDT1     = (0x11CU + 0x800U), /*!< WWDT1     clock divider */
    kCLOCK_DivLPI2C0    = (0x124U + 0x800U), /*!< LPI2C0    clock divider */
    kCLOCK_DivLPSPI0    = (0x12CU + 0x800U), /*!< LPSPI0    clock divider */
    kCLOCK_DivLPUART0   = (0x134U + 0x800U), /*!< LPUART0   clock divider */
    kCLOCK_DivLPUART1   = (0x13CU + 0x800U), /*!< LPUART1   clock divider */
    kCLOCK_DivLPUART2   = (0x144U + 0x800U), /*!< LPUART2   clock divider */
    kCLOCK_DivLPUART3   = (0x14CU + 0x800U), /*!< LPUART3   clock divider */
    kCLOCK_DivLPTMR0    = (0x154U + 0x800U), /*!< LPTMR0    clock divider */
    kCLOCK_DivADC       = (0x15CU + 0x800U), /*!< ADC       clock divider */
    kCLOCK_DivCMP0_FUNC = (0x164U + 0x800U), /*!< CMP0_FUNC clock divider */
    kCLOCK_DivCMP0_RR   = (0x16CU + 0x800U), /*!< CMP0_RR   clock divider */
    kCLOCK_DivTRACE     = (0x174U + 0x800U), /*!< TRACE     clock divider */
    kCLOCK_DivCLKOUT    = (0x17CU + 0x800U), /*!< CLKOUT    clock divider */
    kCLOCK_DivSYSTICK   = (0x184U + 0x800U), /*!< SYSTICK   clock divider */
    kCLOCK_DivMax       = (0x184U + 0x800U), /*!< MAX       clock divider */
} clock_div_name_t;

/*!
 * @brief CLK16K clock gate.
 */
typedef enum _clk16k_clk_gate_id
{
    kCLKE_16K_SYSTEM          = VBAT_FROCLKE_CLKE(1U), /*!< CLK16K[0] to SYSTEM domain.      */
    kCLKE_16K_COREMAIN        = VBAT_FROCLKE_CLKE(2U), /*!< CLK16K[1] to CORE domain.        */
    kCLOCK_Clk16kToSys        = VBAT_FROCLKE_CLKE(1U), /*!< CLK16K[0] to SYSTEM domain.      */
    kCLOCK_Clk16kToCore       = VBAT_FROCLKE_CLKE(2U), /*!< CLK16K[1] to CORE domain.        */
    kCLOCK_Clk16kToSysAndCore = VBAT_FROCLKE_CLKE(3U), /*!< CLK16K to SYSTEM and CORE domain.*/
} _clk16k_clk_gate_id;

/*!
 * @brief SCG status return codes.
 */
enum _scg_status
{
    kStatus_SCG_Busy       = MAKE_STATUS(kStatusGroup_SCG, 1), /*!< Clock is busy.  */
    kStatus_SCG_InvalidSrc = MAKE_STATUS(kStatusGroup_SCG, 2)  /*!< Invalid source. */
};

/*!
 * @brief sirc trim mode.
 */
typedef enum _sirc_trim_mode
{
    kSCG_SircTrimNonUpdate = SCG_SIRCCSR_SIRCTREN_MASK,
    /*!< Trim enable but not enable trim value update. In this mode, the
     trim value is fixed to the initialized value which is defined by
     trimCoar and trimFine in configure structure \ref sirc_trim_mode_t.*/

